In [5]:
#importing the necesary modules
import pandas as pd
import numpy as np
import os

#Bellow is a path to the files location 
path='C:/Users/kelvin/Desktop/rush'

#Bellow is a list of files in the given location

files=[file for file in os.listdir(path)]

#looping through the above list of files and printing each file in there
for file in files:
    print(file)

.ipynb_checkpoints
cleaning and analysis.ipynb
Sales_April_2019.csv
Sales_August_2019.csv
Sales_December_2019.csv
Sales_February_2019.csv
Sales_January_2019.csv
Sales_July_2019.csv
Sales_June_2019.csv
Sales_March_2019.csv
Sales_May_2019.csv
Sales_November_2019.csv
Sales_October_2019.csv
Sales_September_2019.csv

In [6]:
#now let's find only CSV files 

for file in files:
    if ".csv" in file:
        print(file)

Sales_April_2019.csv
Sales_August_2019.csv
Sales_December_2019.csv
Sales_February_2019.csv
Sales_January_2019.csv
Sales_July_2019.csv
Sales_June_2019.csv
Sales_March_2019.csv
Sales_May_2019.csv
Sales_November_2019.csv
Sales_October_2019.csv
Sales_September_2019.csv

In [13]:
#lets merge all the csv files so that we can do cleaning easilly

all_data=pd.DataFrame()
for file in files:
    if ".csv" in file:
        df=pd.read_csv(path+"/"+file)
        all_data=pd.concat([df,all_data])
        all_data.to_excel("combined sales data.xlsx",index=False)

In [15]:
#now lets confirm whether merging the data has succeeded
data=pd.read_excel('combined sales data.xlsx')
data.shape

(186850, 6)

In [16]:
#now we can start cleaning the data 
#lets drop all rows with NAN data

data=data.dropna()
data.shape

#as observed bellow from the data.shape function, more than 500 rows with NAN data were droped 
#now let's procced to saving our new  dataset with no NANs

(186305, 6)

In [18]:
data.to_excel('combined sales data.xlsx',index=False)

In [20]:
df1=pd.read_excel('combined sales data.xlsx')
df1.tail()

#Bellow is the no Nan dataset tail

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
186300,194090,Google Phone,1,600,04/08/19 17:11,"177 Jackson St, Los Angeles, CA 90001"
186301,194091,AA Batteries (4-pack),1,3.84,04/15/19 16:02,"311 Forest St, Austin, TX 73301"
186302,194092,AAA Batteries (4-pack),2,2.99,04/28/19 14:36,"347 Sunset St, San Francisco, CA 94016"
186303,194093,AA Batteries (4-pack),1,3.84,04/14/19 15:09,"835 Lake St, Portland, OR 97035"
186304,194094,Lightning Charging Cable,1,14.95,04/18/19 11:08,"354 North St, Boston, MA 02215"

In [27]:
#let's rename the columns

data=pd.read_excel('combined sales data.xlsx')
data['order_id']=data['Order ID']
data['Quantity_ordered']=data['Quantity Ordered']
data['price']=data['Price Each']
data['address']=data['Purchase Address']
data['order_date']=data['Order Date']
data=data.drop(['Order ID','Quantity Ordered','Price Each','Order Date','Purchase Address'],axis=1)
data.to_excel('combined sales data.xlsx',index=False)

In [28]:
#as seen bellow,columns have been renamed succesfully
data=pd.read_excel('combined sales data.xlsx')
data.head()

,Product,order_id,Quantity_ordered,price,address,order_date
0,AA Batteries (4-pack),248151,4,3.84,"380 North St, Los Angeles, CA 90001",09/17/19 14:44
1,USB-C Charging Cable,248152,2,11.95,"511 8th St, Austin, TX 73301",09/29/19 10:19
2,USB-C Charging Cable,248153,1,11.95,"151 Johnson St, Los Angeles, CA 90001",09/16/19 17:48
3,27in FHD Monitor,248154,1,149.99,"355 Hickory St, Seattle, WA 98101",09/27/19 07:52
4,USB-C Charging Cable,248155,1,11.95,"125 5th St, Atlanta, GA 30301",09/01/19 19:03

In [31]:
# now we can add ore columns 

#let's add months column 
data=pd.read_excel('combined sales data.xlsx')
data['month']=data['order_date'].astype(str).apply(lambda x:x.split('/')[0])
#let's update our dataset with the new column

data.to_excel('combined sales data.xlsx',index=False)

data.head()

,Product,order_id,Quantity_ordered,price,address,order_date,month
0,AA Batteries (4-pack),248151,4,3.84,"380 North St, Los Angeles, CA 90001",09/17/19 14:44,09
1,USB-C Charging Cable,248152,2,11.95,"511 8th St, Austin, TX 73301",09/29/19 10:19,09
2,USB-C Charging Cable,248153,1,11.95,"151 Johnson St, Los Angeles, CA 90001",09/16/19 17:48,09
3,27in FHD Monitor,248154,1,149.99,"355 Hickory St, Seattle, WA 98101",09/27/19 07:52,09
4,USB-C Charging Cable,248155,1,11.95,"125 5th St, Atlanta, GA 30301",09/01/19 19:03,09